benchmarks/artillery-sync-load-test.yml
config:
  target: "http://localhost:5173"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 10
      name: "Warm up phase (up to ~300 concurrent devices polling every 30s)"
    - duration: 120
      arrivalRate: 10
      rampTo: 30
      name: "Load testing breaking point (~900 concurrent devices polling)"
    - duration: 60
      arrivalRate: 50
      name: "Spike / Stress phase (Simulated network reconnection storm)"
  payload:
    # Optional: can load test orgs from a csv file if needed
    # path: "test-orgs.csv"
    # fields:
    #   - "orgId"
    #   - "syncKey"
  defaults:
    headers:
      Content-Type: "application/json"
      Accept: "application/json"
  variables:
    defaultOrgId: "test-load-org-123"
    defaultSyncKey: "default-sync-key"

scenarios:
  - name: "Offline-First Device Sync Cycle"
    flow:
      # 1. Background Poll (pullEverythingFn) - Executes 40 sequential DB queries per call
      - post:
          url: "/_server/pullEverythingFn"
          json:
            data:
              orgId: "{{ defaultOrgId }}"
              syncKey: "{{ defaultSyncKey }}"
          expect:
            - statusCode: 200
          capture:
            - json: "$.success"
              as: "pullSuccess"
      
      - think: 5 # Shortened think time in Artillery to simulate higher concurrency intensity
      
      # 2. Push Offline Changes (pushEverythingFn) - Occurs after offline sales accumulate
      - post:
          url: "/_server/pushEverythingFn"
          json:
            data:
              orgId: "{{ defaultOrgId }}"
              syncKey: "{{ defaultSyncKey }}"
              changes:
                sales:
                  - id: "artillery-sale-{{ $randomString() }}"
                    organizationId: "{{ defaultOrgId }}"
                    total: "250.00"
                    items: 1
                    paymentMethod: "card"
                    status: "completed"
                    date: "{{ $timestamp }}"
                    saleItems:
                      - productId: "prod-artillery-1"
                        productName: "Test Coffee Bean Bag"
                        quantity: 1
                        price: "250.00"
                        total: "250.00"
          expect:
            - statusCode: 200